# BuiltInFailures.LegendFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LegendFailures Class
BuiltInFailures Class Members See Also
---
Failures about Legend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class LegendFailures
```

Visual Basic
---
```text
Public NotInheritable Class LegendFailures
```

Visual C++
---
```text
public ref class LegendFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..LegendFailures
# See Also
BuiltInFailures..::..LegendFailures Members
Autodesk.Revit.DB Namespace